# IFCProperty Mapping Info Constructor

Source: https://www.revitapidocs.com/2026/402c0782-e464-4371-6962-772cbd2d3c53.htm

---

| IFCProperty Mapping Info Constructor |
| --- |

Constructs a new IFCPropertyMappingInfo with default values.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IFCPropertyMappingInfo()
```

```
Public Sub New
```

```
public:
IFCPropertyMappingInfo()
```

```
new : unit -> IFCPropertyMappingInfo
```
See Also

#### Reference

IFCPropertyMappingInfo Class IFCPropertyMappingInfo Overload Autodesk.Revit.DB Namespace